// © Copyright 2004-2008, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Загрузка файла";
kUploadingTitleStringKey = "Выполняется загрузка…";
kUploadingReceiveResponseTitleStringKey = "Принимается ответ…";

// Errors
kFileOpenError = "Не удается открыть файл %@.";
kFileOpenErrorExplanation = "Данный файл либо поврежден, либо перемещен в другое место, переименован или удален. Проверьте местонахождение файла или выберите другой файл и повторите попытку.";
kPrintChannelOpenError = "Не удается открыть канал принтера.";
kPrintChannelOpenErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";
kSendDataError = "Не удается передать данные на принтер.";
kSendDataErrorExplanation = "Убедитесь в том, что принтер подсоединен и включен, затем повторите попытку.";

HSDDescriptionField = "Выберите файл и передайте его в требуемый принтер. Результат этой операции зависит от содержимого передаваемого файла.";
HSDFilePathLabel = "Загружаемый файл:";
HSDFilePathField = "<Не выбрано>";
HSDChooseButton = "Выберите";
HSDGetResponseButton = "Отображение ответа от устройства";
HSDUploadButton = "Загрузка";

HSDProgressTitle = "Загрузка";
HSDCancelButton = "Отмена";

HSDCloseButton = "Закрыть";
